Modul eFORM/Integračný manuál eFORM/Asynchrónne služby - Rozhranie UIR a G2G/EFORM_CHANGE_FORM_TEMPLATE_MEDATADATA_ASYNC_01/EFORM_CHANGE_FORM_TEMPLATE_MEDATADATA_ASYNC_01.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
	<s:Header>
		<a:Action s:mustUnderstand="1">http://gov.sk/eGov/IService/Receive</a:Action>
		<a:MessageID>urn:uuid:bf060849-94e6-4c56-8ab2-c502dc18f603</a:MessageID>
		<ActivityId CorrelationId="14f9aec8-3712-410d-9a93-6c4b55e93f78" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">3a93512f-193a-4922-83c1-0026fd456a78</ActivityId>
		<a:ReplyTo>
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1">http://vyvoj.upvs.globaltel.sk/g2g/G2GServiceBus/ServiceSkTalk3.svc</a:To>
	</s:Header>
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<Receive xmlns="http://gov.sk/eGov/IService">
			<message>
				<EnvelopeVersion xmlns="http://gov.sk/SKTalkMessage">3.0</EnvelopeVersion>
				<Header xmlns="http://gov.sk/SKTalkMessage">
					<MessageInfo>
						<Class>EFORM_CHANGE_FORM_TEMPLATE_MEDATADATA_ASYNC_01</Class>
						<PospID/>
						<PospVersion/>
						<MessageID>0bb6e1d0-0636-4250-817d-dc6309f1ffc0</MessageID>
						<CorrelationID>2ef77565-eb3d-468b-892c-0397252c1193</CorrelationID>
						<BusinessID/>
						<ChannelInfo>
							<Channel>
								<ChannelInfoURI>http://eformapp/_vti_bin/eFLCMService.svc/ws</ChannelInfoURI>
							</Channel>
						</ChannelInfo>
						<ChannelInfoReply>
							<Channel>
								<ChannelInfoURI>http://eformapp/_vti_bin/eFLCMService.svc/ws</ChannelInfoURI>
							</Channel>
						</ChannelInfoReply>
					</MessageInfo>
					<SenderInfo>
						<SecurityMethod>security_method</SecurityMethod>
						<SecurityToken/>
						<Identity/>
					</SenderInfo>
					<RoutingInfo/>
				</Header>
				<Body xmlns="http://gov.sk/SKTalkMessage">
					<ChangeFormTemplateMetaData_Request xmlns="http://schemas.gov.sk/eflcm/ChangeFormTemplateMetaData/1.0">
						<Request>
							<Title>Žiadosť na zmenu metadát vzoru</Title>
							<Description>test ziadosti MD - itu SOAPUI</Description>
							<Publisher>UPVS</Publisher>
							<Gestor>UPVSP-VYVOJ\iturcan</Gestor>
						</Request>
						<MetaData>
							<Identifier>POSP</Identifier>
							<Title>POSP</Title>
							<Type>POSP</Type>
							<Description>toto je popis formulara</Description>
							<Gestor>UPVSP-VYVOJ\eform.notify.gestor2</Gestor>
							<Publisher>UPVS</Publisher>
							<Section/>
							<Agenda/>
							<Source/>
							<Version>
								<Major>1</Major>
								<Minor>0</Minor>
							</Version>
							<ValidDateFrom>2013-09-09</ValidDateFrom>
							<ValidDateTo>0001-01-01</ValidDateTo>
							<Keywords/>
						</MetaData>
					</ChangeFormTemplateMetaData_Request>
				</Body>
			</message>
		</Receive>
	</s:Body>
</s:Envelope>
